{
    "presentation": {
      "intro": "Ophélie Azor - \nDéveloppeuse web",
      "name": "Ophélie Azor",
      "age": "26 ans",
      "background": "Après avoir suivi une formation d'intégratrice web pendant 2 mois, dont 1 mois en entreprise, j'ai renforcé mes compétences avec une formation de 8 mois en développement web. \n\nCette double expérience m'a permis d'acquérir une solide compréhension des principes de conception web et de développement, me préparant à relever \ndes défis variés dans le domaine du web.",
      "mission": "Mon parcours m'a non seulement appris à maîtriser les outils et technologies du développement web, mais aussi à adopter une approche méthodique et agile dans la gestion de projets. \n\nJe suis désormais prête à mettre en pratique ces connaissances pour contribuer à des projets innovants et stimulants."
    },
    "formations": [
      {
        "title": "Développeur Intégrateur d'Applications Web",
        "location": "Valenciennes, Hauts-de-France", 
        "year": "Du 12 Avril 2023 au 5 Juin 2023",
        "description": "Cette formation de préqualification a pour objectif de découvrir les métiers liés à l’intégration web et d’initier le développement des compétences nécessaires à la réalisation des principales activités de le⋅a développeur·se intégrateur·rice. ",
      "duration": "3 mois",
        "link": "https://www.simplon.co/session/hdf-lille-devinte-p7"
      },
      {
        "title": "Développeur Web",
        "location": "Valenciennes, Hauts-de-France",
        "year": "Du 19 Mars 2024 au 18 Novembre 2024",
        "description": "Cette formation permet d'acquérir les compétences nécessaires pour concevoir, développer et maintenir des sites web dynamiques. Vous apprendrez à maîtriser les langages clés comme HTML, CSS, JavaScript, React, ainsi que des outils de gestion de versions tels que Git/GitHub. En plus du développement front-end, vous découvrirez le développement back-end avec NodeJS, Express et MongoDB, vous permettant de créer des sites web complets.",
        "duration": "8 mois",
        "link": "https://openclassrooms.com/fr/paths/899-developpeur-web"
      }
    ],
    "experiences": [
      {
        "title": "Stage de Développement Web chez EXERIALE",
        "location": " Paris 15,  Île-de-France",
        "year": "Du 6 Juin 2023 au 3 Juillet 2023",
        "description": "Pendant mon stage en tant que développeur web, j’ai été chargé de créer un site internet pour l’entreprise, dans le but de renforcer sa présence en ligne et de présenter ses services à ses clients. Ce projet m’a permis de travailler sur l’ensemble des aspects du développement web, de la conception à la mise en ligne.",
        "duration": "1 mois"
      }
    ]
  ,
   
      "skills": {
        "frontEnd": [
          {
            "icon": "fab fa-html5",
            "title": "HTML5",
            "description": "Maîtrise des balises HTML, structuration du contenu, optimisation pour le SEO."
          },
          {
            "icon": "fab fa-css3-alt",
            "title": "CSS3",
            "description": "Création de mises en page responsive, animations et transitions."
          },
          {
            "icon": "fab fa-js",
            "title": "JavaScript",
            "description": "Programmation côté client, manipulation du DOM, gestion des événements."
          },
          {
            "icon": "fab fa-react",
            "title": "React",
            "description": "Création de composants réutilisables, gestion de l'état avec hooks."
          }
        ],
        "backEnd": [
          {
            "icon": "fab fa-node-js",
            "title": "Node.js",
            "description": "Développement côté serveur avec JavaScript, gestion des requêtes HTTP."
          },
          {
            "icon": "fas fa-server",
            "title": "Express",
            "description": "Framework pour Node.js pour créer des APIs et gérer les routes."
          },
          {
            "icon": "fas fa-database",
            "title": "Bases de Données",
            "description": "SQL, NoSQL, gestion des données et intégration avec les applications."
          },
          {
            "icon": "fas fa-plug",
            "title": "APIs REST",
            "description": "Création et gestion des APIs RESTful pour la communication entre services."
          }
        ],
        "tools": [
          {
            "icon": "fab fa-github",
            "title": "GitHub",
            "description": "Gestion de versions et collaboration sur les projets de développement."
          },
          {
            "icon": "fab fa-js",
            "title": "VSCode",
            "description": "Environnement de développement intégré pour le code."
          },
          {
            "icon": "fab fa-figma",
            "title": "Figma",
            "description": "Outil de conception d'interface utilisateur et prototypage."
          },
          {
            "icon": "fab fa-trello",
            "title": "Trello",
            "description": "Outil de gestion de projets et de tâches."
          }
        ],
       
         "projects": [
        {
            "title": "Booki",
            "description": "\nSite web développé pour une agence de voyage, conçu pour faciliter la réservation d'hébergements et d'activités dans la ville de choix des utilisateurs. \n",
           "problems": [
    "\n• Intégration d'une interface responsive basée sur des maquettes Figma pour mobile, tablette et desktop."
   ],
            "solutions": "\n• Écriture de code HTML et CSS personnalisé en suivant les maquettes \n• collaboration étroite avec l’UI designer.",
            "skillsDeveloped": "\nHTML, CSS, design responsive, versionnement avec Git.\n\n",
            "github": "https://github.com/azorophelie/OpenClassrooms-Projet-2",
            "githubPages": "https://azorophelie.github.io/OpenClassrooms-Projet-2/",
            "spaceAfterskillsDeveloped": true 
        },
        {
            "title": "Bluel",
            "description": "\nSite portfolio pour une architecte d'intèrieur .\n\n",
            "problems": [
                "\n• Difficulté à récupérer les travaux de l'architecte à partir du back-end en utilisant l'API.",
                "\n• Les travaux ne s'affichent pas dynamiquement sur la galerie.",
                "\n• Difficulté à supprimer des travaux du site sans recharger la page."
            ],
         "solutions": [ "\n• Utiliser `fetch` pour faire une requête GET et récupérer les données.",
         "\n• Générer dynamiquement les éléments HTML après récupération des données.",
         "\n• Envoyer une requête DELETE à l'API et mettre à jour le DOM en conséquence."
          ],
            "skillsDeveloped": "\nJavaScript, gestion du DOM, utilisation des API REST, travail avec Figma.",
            "github": "https://github.com/azorophelie/OpenClassrooms-Projet-3"
        },
        {
          "title": "Kasa",
          "description": "\nRefonte du site Kasa, une entreprise de location d’appartements entre particuliers, visant à passer d'une architecture ASP.NET à une stack JavaScript avec NodeJS et React.",
          "problems": [
            "\n• Difficulté à gérer les données des annonces.",
            "\n• Navigation complexe entre les différentes pages.",
            "\n• Difficulté à appliquer un design responsive."
        ],
          "solutions": [
        "\n• Utiliser React pour gérer l'état et les données.",
        "\n• Configurer React Router pour une navigation fluide.",
        "\n• Appliquer des styles responsives avec CSS."
    ],
        
          "skillsDeveloped": "\nJavaScript, React, React Router, Sass.\n\n\n\n",
          "github": "https://github.com/azorophelie/OpenClassrooms-Projet-5",
          "githubPages": "https://azorophelie.github.io/OpenClassrooms-Projet-5/"
      },
      {
          "title": "Mon Vieux Grimoire",
          "description": "\nSite web de notation de livres pour la chaîne de librairies 'Le Vieux Grimoire'. Permet aux utilisateurs d'ajouter des livres et de laisser des notes, tout en optimisant les images pour une expérience utilisateur fluide.",

          "problems": [
            "\n• Créer un serveur back-end pour gérer l'ajout et la notation des livres.",
            "\n• Assurer la sécurité des données et l'authentification des utilisateurs.",
            "\n• Gérer le téléchargement et l'optimisation des images pour le site, tout en respectant les bonnes pratiques du Green Code."
          ],
          "solutions": [
          "\n• Utiliser Express pour développer le serveur et le connecter à MongoDB pour stocker les données.",
          "\n• Implémenter des opérations CRUD pour gérer les livres et les notations.",
          "\n• Mettre en place un système d'authentification sécurisé avec des tokens.",
          "\n• Optimiser les images téléchargées pour réduire l'empreinte écologique du site."
          ],
          "skillsDeveloped": "\nNode.js, Express, MongoDB, Mongoose, gestion des opérations CRUD, sécurisation des données, optimisation des images, architecture MVC.\n\n\n",
          "github": "https://github.com/azorophelie/OpenClassrooms_Projet_6"
      }
  ]
      
    
}
}

      
      
    
    